Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxScu_bf.h
/** \brief Length for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_LEN (2u)

/** \brief Mask for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_MSK (0x3u)

/** \brief Offset for Ifx_SCU_RSTCON_Bits.STM0 */
#define IFX_SCU_RSTCON_STM0_OFF (10u)

/** \brief Length for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_LEN (2u)

/** \brief Mask for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_MSK (0x3u)

/** \brief Offset for Ifx_SCU_RSTCON_Bits.STM1 */
#define IFX_SCU_RSTCON_STM1_OFF (12u)

/** \brief Length for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_LEN (2u)

/** \brief Mask for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_MSK (0x3u)

/** \brief Offset for Ifx_SCU_RSTCON_Bits.STM2 */
#define IFX_SCU_RSTCON_STM2_OFF (14u)

/** \brief Length for Ifx_SCU_RSTCON_Bits.STM3 */
#define IFX_SCU_RSTCON_STM3_LEN (2u)

/** \brief Mask for Ifx_SCU_RSTCON_Bits.STM3 */
#define IFX_SCU_RSTCON_STM3_MSK (0x3u)

/** \brief Offset for Ifx_SCU_RSTCON_Bits.STM3 */
#define IFX_SCU_RSTCON_STM3_OFF (16u)

/** \brief Length for Ifx_SCU_RSTCON_Bits.STM4 */
#define IFX_SCU_RSTCON_STM4_LEN (2u)

/** \brief Mask for Ifx_SCU_RSTCON_Bits.STM4 */
#define IFX_SCU_RSTCON_STM4_MSK (0x3u)

/** \brief Offset for Ifx_SCU_RSTCON_Bits.STM4 */
#define IFX_SCU_RSTCON_STM4_OFF (18u)

/** \brief Length for Ifx_SCU_RSTCON_Bits.STM5 */
#define IFX_SCU_RSTCON_STM5_LEN (2u)

/** \brief Mask for Ifx_SCU_RSTCON_Bits.STM5 */
#define IFX_SCU_RSTCON_STM5_MSK (0x3u)

/** \brief Offset for Ifx_SCU_RSTCON_Bits.STM5 */
#define IFX_SCU_RSTCON_STM5_OFF (20u)

/** \brief Length for Ifx_SCU_ARSTDIS_Bits.STM0DIS */
#define IFX_SCU_ARSTDIS_STM0DIS_LEN (1u)

/** \brief Mask for Ifx_SCU_ARSTDIS_Bits.STM0DIS */
#define IFX_SCU_ARSTDIS_STM0DIS_MSK (0x1u)

/** \brief Offset for Ifx_SCU_ARSTDIS_Bits.STM0DIS */
#define IFX_SCU_ARSTDIS_STM0DIS_OFF (0u)

/** \brief Length for Ifx_SCU_ARSTDIS_Bits.STM1DIS */
#define IFX_SCU_ARSTDIS_STM1DIS_LEN (1u)

/** \brief Mask for Ifx_SCU_ARSTDIS_Bits.STM1DIS */
#define IFX_SCU_ARSTDIS_STM1DIS_MSK (0x1u)

/** \brief Offset for Ifx_SCU_ARSTDIS_Bits.STM1DIS */
#define IFX_SCU_ARSTDIS_STM1DIS_OFF (1u)

/** \brief Length for Ifx_SCU_ARSTDIS_Bits.STM2DIS */
#define IFX_SCU_ARSTDIS_STM2DIS_LEN (1u)

/** \brief Mask for Ifx_SCU_ARSTDIS_Bits.STM2DIS */
#define IFX_SCU_ARSTDIS_STM2DIS_MSK (0x1u)

/** \brief Offset for Ifx_SCU_ARSTDIS_Bits.STM2DIS */
#define IFX_SCU_ARSTDIS_STM2DIS_OFF (2u)

/** \brief Length for Ifx_SCU_ARSTDIS_Bits.STM3DIS */
#define IFX_SCU_ARSTDIS_STM3DIS_LEN (1u)

/** \brief Mask for Ifx_SCU_ARSTDIS_Bits.STM3DIS */
#define IFX_SCU_ARSTDIS_STM3DIS_MSK (0x1u)

/** \brief Offset for Ifx_SCU_ARSTDIS_Bits.STM3DIS */
#define IFX_SCU_ARSTDIS_STM3DIS_OFF (3u)

/** \brief Length for Ifx_SCU_ARSTDIS_Bits.STM4DIS */
#define IFX_SCU_ARSTDIS_STM4DIS_LEN (1u)

/** \brief Mask for Ifx_SCU_ARSTDIS_Bits.STM4DIS */
#define IFX_SCU_ARSTDIS_STM4DIS_MSK (0x1u)

/** \brief Offset for Ifx_SCU_ARSTDIS_Bits.STM4DIS */
#define IFX_SCU_ARSTDIS_STM4DIS_OFF (4u)

/** \brief Length for Ifx_SCU_ARSTDIS_Bits.STM5DIS */
#define IFX_SCU_ARSTDIS_STM5DIS_LEN (1u)

/** \brief Mask for Ifx_SCU_ARSTDIS_Bits.STM5DIS */
#define IFX_SCU_ARSTDIS_STM5DIS_MSK (0x1u)

/** \brief Offset for Ifx_SCU_ARSTDIS_Bits.STM5DIS */
#define IFX_SCU_ARSTDIS_STM5DIS_OFF (5u)

/** \brief Length for Ifx_SCU_SWRSTCON_Bits.SWRSTREQ */
#define IFX_SCU_SWRSTCON_SWRSTREQ_LEN (1u)

/** \brief Mask for Ifx_SCU_SWRSTCON_Bits.SWRSTREQ */
#define IFX_SCU_SWRSTCON_SWRSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_SCU_SWRSTCON_Bits.SWRSTREQ */
#define IFX_SCU_SWRSTCON_SWRSTREQ_OFF (1u)

/** \brief Length for Ifx_SCU_RSTCON2_Bits.FRTO */
#define IFX_SCU_RSTCON2_FRTO_LEN (1u)

/** \brief Mask for Ifx_SCU_RSTCON2_Bits.FRTO */
#define IFX_SCU_RSTCON2_FRTO_MSK (0x1u)

/** \brief Offset for Ifx_SCU_RSTCON2_Bits.FRTO */
#define IFX_SCU_RSTCON2_FRTO_OFF (0u)

/** \brief Length for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_LEN (1u)

/** \brief Mask for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_MSK (0x1u)

/** \brief Offset for Ifx_SCU_RSTCON2_Bits.CLRC */
#define IFX_SCU_RSTCON2_CLRC_OFF (1u)

/** \brief Length for Ifx_SCU_RSTCON2_Bits.CSSx */
#define IFX_SCU_RSTCON2_CSSX_LEN (6u)

/** \brief Mask for Ifx_SCU_RSTCON2_Bits.CSSx */
#define IFX_SCU_RSTCON2_CSSX_MSK (0x3fu)

/** \brief Offset for Ifx_SCU_RSTCON2_Bits.CSSx */
#define IFX_SCU_RSTCON2_CSSX_OFF (7u)

/** \brief Length for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_LEN (16u)

/** \brief Mask for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_MSK (0xffffu)

/** \brief Offset for Ifx_SCU_RSTCON2_Bits.USRINFO */
#define IFX_SCU_RSTCON2_USRINFO_OFF (16u)

/** \brief Length for Ifx_SCU_ESRCFGX_ESRCFGX_Bits.EDCON */
#define IFX_SCU_ESRCFGX_ESRCFGX_EDCON_LEN (2u)

/** \brief Mask for Ifx_SCU_ESRCFGX_ESRCFGX_Bits.EDCON */
#define IFX_SCU_ESRCFGX_ESRCFGX_EDCON_MSK (0x3u)

/** \brief Offset for Ifx_SCU_ESRCFGX_ESRCFGX_Bits.EDCON */
#define IFX_SCU_ESRCFGX_ESRCFGX_EDCON_OFF (7u)

/** \brief Length for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_LEN (1u)

/** \brief Mask for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_MSK (0x1u)

/** \brief Offset for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_OFF (0u)

/** \brief Length for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_LEN (1u)

/** \brief Mask for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_MSK (0x1u)

/** \brief Offset for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_OFF (1u)

/** \brief Length for Ifx_SCU_SYSCON_Bits.CCTRIG0 */
#define IFX_SCU_SYSCON_CCTRIG0_LEN (1u)

/** \brief Mask for Ifx_SCU_SYSCON_Bits.CCTRIG0 */
#define IFX_SCU_SYSCON_CCTRIG0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_SYSCON_Bits.CCTRIG0 */
#define IFX_SCU_SYSCON_CCTRIG0_OFF (0u)

/** \brief Length for Ifx_SCU_SYSCON_Bits.RAMINTM */
#define IFX_SCU_SYSCON_RAMINTM_LEN (2u)

/** \brief Mask for Ifx_SCU_SYSCON_Bits.RAMINTM */
#define IFX_SCU_SYSCON_RAMINTM_MSK (0x3u)

/** \brief Offset for Ifx_SCU_SYSCON_Bits.RAMINTM */
#define IFX_SCU_SYSCON_RAMINTM_OFF (2u)

