Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxScu_bf.h
/** \brief Offset for Ifx_SCU_STSTAT_Bits.FTM */
#define IFX_SCU_STSTAT_FTM_OFF (8u)

/** \brief Length for Ifx_SCU_STSTAT_Bits.MODE */
#define IFX_SCU_STSTAT_MODE_LEN (1u)

/** \brief Mask for Ifx_SCU_STSTAT_Bits.MODE */
#define IFX_SCU_STSTAT_MODE_MSK (0x1u)

/** \brief Offset for Ifx_SCU_STSTAT_Bits.MODE */
#define IFX_SCU_STSTAT_MODE_OFF (15u)

/** \brief Length for Ifx_SCU_STSTAT_Bits.FCBAE */
#define IFX_SCU_STSTAT_FCBAE_LEN (1u)

/** \brief Mask for Ifx_SCU_STSTAT_Bits.FCBAE */
#define IFX_SCU_STSTAT_FCBAE_MSK (0x1u)

/** \brief Offset for Ifx_SCU_STSTAT_Bits.FCBAE */
#define IFX_SCU_STSTAT_FCBAE_OFF (16u)

/** \brief Length for Ifx_SCU_STSTAT_Bits.LUDIS */
#define IFX_SCU_STSTAT_LUDIS_LEN (1u)

/** \brief Mask for Ifx_SCU_STSTAT_Bits.LUDIS */
#define IFX_SCU_STSTAT_LUDIS_MSK (0x1u)

/** \brief Offset for Ifx_SCU_STSTAT_Bits.LUDIS */
#define IFX_SCU_STSTAT_LUDIS_OFF (17u)

/** \brief Length for Ifx_SCU_STSTAT_Bits.TRSTL */
#define IFX_SCU_STSTAT_TRSTL_LEN (1u)

/** \brief Mask for Ifx_SCU_STSTAT_Bits.TRSTL */
#define IFX_SCU_STSTAT_TRSTL_MSK (0x1u)

/** \brief Offset for Ifx_SCU_STSTAT_Bits.TRSTL */
#define IFX_SCU_STSTAT_TRSTL_OFF (19u)

/** \brief Length for Ifx_SCU_STSTAT_Bits.SPDEN */
#define IFX_SCU_STSTAT_SPDEN_LEN (1u)

/** \brief Mask for Ifx_SCU_STSTAT_Bits.SPDEN */
#define IFX_SCU_STSTAT_SPDEN_MSK (0x1u)

/** \brief Offset for Ifx_SCU_STSTAT_Bits.SPDEN */
#define IFX_SCU_STSTAT_SPDEN_OFF (20u)

/** \brief Length for Ifx_SCU_STSTAT_Bits.RAMINT */
#define IFX_SCU_STSTAT_RAMINT_LEN (1u)

/** \brief Mask for Ifx_SCU_STSTAT_Bits.RAMINT */
#define IFX_SCU_STSTAT_RAMINT_MSK (0x1u)

/** \brief Offset for Ifx_SCU_STSTAT_Bits.RAMINT */
#define IFX_SCU_STSTAT_RAMINT_OFF (24u)

/** \brief Length for Ifx_SCU_STCON_Bits.SFCBAE */
#define IFX_SCU_STCON_SFCBAE_LEN (1u)

/** \brief Mask for Ifx_SCU_STCON_Bits.SFCBAE */
#define IFX_SCU_STCON_SFCBAE_MSK (0x1u)

/** \brief Offset for Ifx_SCU_STCON_Bits.SFCBAE */
#define IFX_SCU_STCON_SFCBAE_OFF (13u)

/** \brief Length for Ifx_SCU_STCON_Bits.CFCBAE */
#define IFX_SCU_STCON_CFCBAE_LEN (1u)

/** \brief Mask for Ifx_SCU_STCON_Bits.CFCBAE */
#define IFX_SCU_STCON_CFCBAE_MSK (0x1u)

/** \brief Offset for Ifx_SCU_STCON_Bits.CFCBAE */
#define IFX_SCU_STCON_CFCBAE_OFF (14u)

/** \brief Length for Ifx_SCU_STCON_Bits.STP */
#define IFX_SCU_STCON_STP_LEN (1u)

/** \brief Mask for Ifx_SCU_STCON_Bits.STP */
#define IFX_SCU_STCON_STP_MSK (0x1u)

/** \brief Offset for Ifx_SCU_STCON_Bits.STP */
#define IFX_SCU_STCON_STP_OFF (15u)

/** \brief Length for Ifx_SCU_PMCSR0_Bits.REQSLP */
#define IFX_SCU_PMCSR0_REQSLP_LEN (2u)

/** \brief Mask for Ifx_SCU_PMCSR0_Bits.REQSLP */
#define IFX_SCU_PMCSR0_REQSLP_MSK (0x3u)

/** \brief Offset for Ifx_SCU_PMCSR0_Bits.REQSLP */
#define IFX_SCU_PMCSR0_REQSLP_OFF (0u)

/** \brief Length for Ifx_SCU_PMCSR0_Bits.PMST */
#define IFX_SCU_PMCSR0_PMST_LEN (3u)

/** \brief Mask for Ifx_SCU_PMCSR0_Bits.PMST */
#define IFX_SCU_PMCSR0_PMST_MSK (0x7u)

/** \brief Offset for Ifx_SCU_PMCSR0_Bits.PMST */
#define IFX_SCU_PMCSR0_PMST_OFF (8u)

/** \brief Length for Ifx_SCU_PMCSR1_Bits.REQSLP */
#define IFX_SCU_PMCSR1_REQSLP_LEN (2u)

/** \brief Mask for Ifx_SCU_PMCSR1_Bits.REQSLP */
#define IFX_SCU_PMCSR1_REQSLP_MSK (0x3u)

/** \brief Offset for Ifx_SCU_PMCSR1_Bits.REQSLP */
#define IFX_SCU_PMCSR1_REQSLP_OFF (0u)

/** \brief Length for Ifx_SCU_PMCSR1_Bits.PMST */
#define IFX_SCU_PMCSR1_PMST_LEN (3u)

/** \brief Mask for Ifx_SCU_PMCSR1_Bits.PMST */
#define IFX_SCU_PMCSR1_PMST_MSK (0x7u)

/** \brief Offset for Ifx_SCU_PMCSR1_Bits.PMST */
#define IFX_SCU_PMCSR1_PMST_OFF (8u)

/** \brief Length for Ifx_SCU_PMCSR2_Bits.REQSLP */
#define IFX_SCU_PMCSR2_REQSLP_LEN (2u)

/** \brief Mask for Ifx_SCU_PMCSR2_Bits.REQSLP */
#define IFX_SCU_PMCSR2_REQSLP_MSK (0x3u)

/** \brief Offset for Ifx_SCU_PMCSR2_Bits.REQSLP */
#define IFX_SCU_PMCSR2_REQSLP_OFF (0u)

/** \brief Length for Ifx_SCU_PMCSR2_Bits.PMST */
#define IFX_SCU_PMCSR2_PMST_LEN (3u)

/** \brief Mask for Ifx_SCU_PMCSR2_Bits.PMST */
#define IFX_SCU_PMCSR2_PMST_MSK (0x7u)

/** \brief Offset for Ifx_SCU_PMCSR2_Bits.PMST */
#define IFX_SCU_PMCSR2_PMST_OFF (8u)

/** \brief Length for Ifx_SCU_PMCSR3_Bits.REQSLP */
#define IFX_SCU_PMCSR3_REQSLP_LEN (2u)

/** \brief Mask for Ifx_SCU_PMCSR3_Bits.REQSLP */
#define IFX_SCU_PMCSR3_REQSLP_MSK (0x3u)

/** \brief Offset for Ifx_SCU_PMCSR3_Bits.REQSLP */
#define IFX_SCU_PMCSR3_REQSLP_OFF (0u)

/** \brief Length for Ifx_SCU_PMCSR3_Bits.PMST */
#define IFX_SCU_PMCSR3_PMST_LEN (3u)

/** \brief Mask for Ifx_SCU_PMCSR3_Bits.PMST */
#define IFX_SCU_PMCSR3_PMST_MSK (0x7u)

/** \brief Offset for Ifx_SCU_PMCSR3_Bits.PMST */
#define IFX_SCU_PMCSR3_PMST_OFF (8u)

/** \brief Length for Ifx_SCU_PMCSR4_Bits.REQSLP */
#define IFX_SCU_PMCSR4_REQSLP_LEN (2u)

/** \brief Mask for Ifx_SCU_PMCSR4_Bits.REQSLP */
#define IFX_SCU_PMCSR4_REQSLP_MSK (0x3u)

/** \brief Offset for Ifx_SCU_PMCSR4_Bits.REQSLP */
#define IFX_SCU_PMCSR4_REQSLP_OFF (0u)

/** \brief Length for Ifx_SCU_PMCSR4_Bits.PMST */
#define IFX_SCU_PMCSR4_PMST_LEN (3u)

/** \brief Mask for Ifx_SCU_PMCSR4_Bits.PMST */
#define IFX_SCU_PMCSR4_PMST_MSK (0x7u)

/** \brief Offset for Ifx_SCU_PMCSR4_Bits.PMST */
#define IFX_SCU_PMCSR4_PMST_OFF (8u)

/** \brief Length for Ifx_SCU_PMCSR5_Bits.REQSLP */
#define IFX_SCU_PMCSR5_REQSLP_LEN (2u)

/** \brief Mask for Ifx_SCU_PMCSR5_Bits.REQSLP */
#define IFX_SCU_PMCSR5_REQSLP_MSK (0x3u)

/** \brief Offset for Ifx_SCU_PMCSR5_Bits.REQSLP */
#define IFX_SCU_PMCSR5_REQSLP_OFF (0u)

/** \brief Length for Ifx_SCU_PMCSR5_Bits.PMST */
#define IFX_SCU_PMCSR5_PMST_LEN (3u)

/** \brief Mask for Ifx_SCU_PMCSR5_Bits.PMST */
#define IFX_SCU_PMCSR5_PMST_MSK (0x7u)

/** \brief Offset for Ifx_SCU_PMCSR5_Bits.PMST */
#define IFX_SCU_PMCSR5_PMST_OFF (8u)

/** \brief Length for Ifx_SCU_PMSTAT0_Bits.CPU0 */
#define IFX_SCU_PMSTAT0_CPU0_LEN (1u)

/** \brief Mask for Ifx_SCU_PMSTAT0_Bits.CPU0 */
#define IFX_SCU_PMSTAT0_CPU0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_PMSTAT0_Bits.CPU0 */
#define IFX_SCU_PMSTAT0_CPU0_OFF (0u)

/** \brief Length for Ifx_SCU_PMSTAT0_Bits.CPU1 */
#define IFX_SCU_PMSTAT0_CPU1_LEN (1u)

/** \brief Mask for Ifx_SCU_PMSTAT0_Bits.CPU1 */
#define IFX_SCU_PMSTAT0_CPU1_MSK (0x1u)

/** \brief Offset for Ifx_SCU_PMSTAT0_Bits.CPU1 */
#define IFX_SCU_PMSTAT0_CPU1_OFF (1u)

